Revit 2026 API

# ExporterIFCPushTransform Method

---

Sets the internal transform of the exporter to process the geometry and properties of the input element.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PushTransform(
	Transform trf
)
```
```vb
Public Sub PushTransform (
	trf As Transform
)
```
```cpp
public:
void PushTransform(
	Transform^ trf
)
```
```fsharp
member PushTransform :
        trf : Transform -> unit
```

#### Parameters

trf Transform
     The transform.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace